syllabus/syllabus_financial_data.tex
% Created 2017-02-02 Thu 16:55
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{setspace}
\singlespace
\usepackage{CJK}
\usepackage{parskip}
\setcounter{secnumdepth}{1}
\author{Zongye Huang and Zheng Tian}
\date{Spring semester, 2017}
\title{Syllabus for Financial Data Analysis}
\hypersetup{
 pdfauthor={Zongye Huang and Zheng Tian},
 pdftitle={Syllabus for Financial Data Analysis},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.3)},
 pdflang={English}}
\begin{document}

\maketitle

\section{Basic information}
\label{sec:orgf095431}

\subsection*{Time and location}
\label{sec:orge153100}

\begin{center}
\begin{tabular}{llll}
Odd weeks & Monday & 13:30 -- 15:20 & Mingbian Building (\begin{CJK}{UTF8}{gbsn}明辨楼\end{CJK}) 511\\
 & Tuesday & 15:40 -- 17:30 & Buoxue Building (\begin{CJK}{UTF8}{gbsn}博学楼\end{CJK}) 316\\
Even weeks & Tuesday & 15:40 -- 17:30 & Buoxue Building (\begin{CJK}{UTF8}{gbsn}博学楼\end{CJK}) 316\\
\end{tabular}
\end{center}


\subsection*{Instructor information}
\label{sec:org9b994c1}

\begin{center}
\begin{tabular}{lll}
Name: & Zongye Huang (\begin{CJK}{UTF8}{gbsn}黄宗晔\end{CJK}) & Zheng Tian (\begin{CJK}{UTF8}{gbsn}田峥\end{CJK})\\
Email: & zongyeh@163.com & ztian\_cueb@163.com\\
Office: & Chengming Building (\begin{CJK}{UTF8}{gbsn}诚明楼\end{CJK}) 215 & Angong Building (\begin{CJK}{UTF8}{gbsn}安工楼\end{CJK}) 215\\
Tel: & 8395-1643 & 8395-1054\\
\end{tabular}
\end{center}


\subsection*{Office hours}
\label{sec:org943ad35}
Office hours are tentatively scheduled as follows,

\begin{itemize}
\item {\bfseries\sffamily TODO} Add Zongye's office hour here
\label{sec:org0a55756}
\begin{center}
\begin{tabular}{lllll}
Zongye Huang &  &  &  & \\
Zheng Tian & Tuesday & 9:30 am -- 11:30 am & Friday & 9:30 am -- 11:30 am\\
\end{tabular}
\end{center}

You are welcomed to stop by our offices at any other time. But making
an appointment by email or phone in advance is highly recommended.
\end{itemize}


\section{Course description}
\label{sec:org1026f67}

Financial data analysis is a required upper-division course for
undergraduate students majored in financial economics. In this course,
we introduce basic econometric methods applied to financial data, with
the following goals: (1) familiarizing students with the features of
financial data, (2) equipping students with econometric models to
analyze the trend of financial time series and make prediction, and
(3) enabling students to implement these techniques using computer
software, primarily R programming language.

This course weighs equally on both theoretical and practical
learning. As for theories regarding financial time series, we will
learn such topics as linear time series models for stationary series,
such as AR, MA, ARMA, and for unit-root non-stationary series;
volatility analysis, for example, ARCH, GARCH models; and risk
analysis, primarily VaR. Practical learning involves using R to read,
manipulate, and analyze financial data with real applications.


\section{Textbooks}
\label{sec:orgc6047b1}

\begin{itemize}
\item Analysis of Financial Time Series, 3rd Edition, by Ruey S. Tsay.
(\begin{CJK}{UTF8}{gbsn}金融时间序列分析\end{CJK})
\url{https://www.amazon.cn/dp/0470414359/ref=sr\_1\_fkmr0\_2?ie=UTF8\&qid=1486067026\&sr=8-2-fkmr0\&keywords=Analysis+of+Financial+Time+Series\%2C+3rd+Edition\%2C+by+Ruey+S.+Tsay}

\item An Introduction to Analysis of Financial Data with R, 1st Edition,
by Ruey S. Tsay (\begin{CJK}{UTF8}{gbsn}金融数据分析导论:基于R语言
\end{CJK}) \url{https://www.amazon.cn/An-Introduction-to-Analysis-of-Financial-Data-with-R-Tsay-Ruey-S/dp/0470890819/ref=pd\_sim\_14\_1?ie=UTF8\&psc=1\&refRID=PD43V5MGW9BPSD9TSWWH}
\end{itemize}


\section{Course materials}
\label{sec:org8aa4283}

\subsection*{Lecture notes}
\label{sec:org04566ce}

Lecture notes will contain all contents to be taught in class, which
are the basis for homework and exams. Previewing and reviewing them
will be greatly helpful for learning this course besides reading
textbooks. All lecture notes will be uploaded online and sent by email before
each session. Please give us your accessible email address as soon as
possible.

\subsection*{Data}
\label{sec:org8c949f9}

We will use large amounts of financial data. All data sets will be
maintained in Baidu Cloud (or GitHub) from which you can download.

\subsection*{Software}
\label{sec:org77be584}

R is the primary software we will use to analyze financial data. You
can download (or update to the latest version of) R at
\url{https://mirrors.tuna.tsinghua.edu.cn/CRAN/}. RStudio is the GUI
(graphic user interface) of R. We will use it to edit R code and write
empirical reports. Download it at
\url{https://www.rstudio.com/products/rstudio/download/}.

GitHub is a platform for maintaining projects and collaborating with
team members. Basic knowledge about GitHub and Git (a version control
system) is necessary. In this semester, we are planning to use GitHub
to manage and submit course projects. Please first register a free
account at \url{https://github.com/}. A short tutorial is available upon
finishing registration. A complete tutorial for Git and GitHub will be
offered in class. If you are interested, try to install Git according to
this instruction
\url{https://git-scm.com/book/en/v2/Getting-Started-Installing-Git}.


\section{Course assignments}
\label{sec:orgb463e08}

\subsection*{Homework}
\label{sec:org61ef1d1}

\begin{itemize}
\item Homework helps students understand fundamentals
theoretical models and practice programming skills.

\item You can finish your homework by either handwriting or typesetting
using word process software, e.g., Microsoft Word, \LaTeX{}, and the
like. Typesetting rather than handwriting is highly recommended.

\item Homework must be submitted on the due day that will be announced in
class. A grace period for late submission can be granted by request
in advance. If granted, you must turn in your homework within one
week after the due day. Late submission of homework is subject to
reducing score to a lower level. No submission at all will result in
no score on homework.
\end{itemize}


\subsection*{Course project}
\label{sec:org1b14a6e}

Course projects help student train research and writing skills as well
as team working spirit. You can choose any topic and use any data set
that are related to this course to complete a mini research
project.

Course projects can be carried out individually or by study group, the
latter of which is preferred. An explanation of study group is in the
next subsection.

The final product of the project include: (1) a research report, (2)
data and code used in the project, and (3) a documentation written in
R Markdown that can be used to reproduce your results. Complete
explanations regarding research reports and documentation will be
given in class.

\subsection*{The requirements for group working}
\label{sec:org2775303}

Admittedly, some questions in homework may be difficult and completing
a whole set of homework may be time consuming. Therefore, we allow you
to form study groups to do homework. Sharing knowledge and helping
fellow students are meritorious, and the spirit of team working is
desirable in many careers.

The formation of study groups is totally voluntary. The size of each
group should not exceed four students, and each student should only
join one group. Please send us the information of your study group no
later than March 6th.

High resemblance of completed homework within each group is
permitted. However, homework that is highly alike between groups will
be treated as shirking, resulting in lower scores for all persons
involved.

Study groups are also course project groups. We want you to learn how
to collaborate with teammates not only mentally but also
practically. GitHub Classroom is a good platform to practice teamwork,
at which you can work on the same file simultaneously and see the
contribution of each team member. (shirking is easily spotted there!)

\subsection*{Exams}
\label{sec:orgde509c7}

\begin{itemize}
\item The mid-term exam
\label{sec:orgce917a7}
\begin{itemize}
\item The mid-term exam is tentatively scheduled in Week 8, which will
cover all contents that Prof. Huang teaches.
\item It will be a closed-book test. But you are allowed to bring a
one-sided "cheat sheet", on which you can write down some notes that
help you remember some important definitions and formulae. You are
allowed to write on only one side on the cheat sheet.
\item If you miss the mid-term exam, a make-up test can be arranged. You
must notify me of your absence in advance with a valid excuse.
\end{itemize}

\item The final exam
\label{sec:orgfb58f36}
\begin{itemize}
\item The final exam is in Week 17, covering all content that Prof. Tian
teaches.
\item It will also be a closed-book, and a one-side cheat sheet will be
allowed.
\item The time and location are to be arranged and announced by the
university.
\item The make-up test will follow the rule of the university.
\end{itemize}
\end{itemize}


\subsection*{Grade distribution}
\label{sec:org7d32a31}

\begin{center}
\begin{tabular}{lr}
Assignments & Scores\\
\hline
Homework & 20\\
Course project & 20\\
Midterm exam & 30\\
Final exam & 30\\
\hline
total & 100\\
\end{tabular}
\end{center}


\section{Course outline}
\label{sec:org269b0da}

The following table is a tentative schedule for this course. Change
will be made contingent on actual progress.

\begin{center}
\begin{tabular}{lll}
Instructors & Topics & Time\\
\hline
Zongye Huang & Introduction to financial data & Weeks 1 to 2\\
 & Stationary time series & Weeks 3 to 5\\
 & Nonstationary time series & Weeks 6 to 7\\
 & Midterm exam & Week 8\\
\hline
Zheng Tian & Conditional heteroskedastic models & Weeks 9 to 12\\
 & Value at Risk & Weeks 13 to 15\\
 & Review and Q\&A & Week 16\\
\hline
 & Final exam & Week 17\\
\end{tabular}
\end{center}


\section{Policy on academic dishonesty}
\label{sec:org08833c2}

Academic dishonesty is defined to include but is not limited to the
following: plagiarism; cheating and dishonest practices in connection
with examinations, papers and projects; forgery, misrepresentation and
fraud. Such behavior will not be tolerated and will be handled
according to university guidelines.
\end{document}